{
  "title": "DeshBidesh",
  "subtitle": "Unity in diversity",
  "url": "http://infinitesunye.com/wp-content/uploads/2021/06/cropped-logo_512x512.png",
  "version": "1",
  "email": "informationdeshbidesh@gmail.com",
  "terms_of_use": "<p><strong>Terms &amp;amp; Conditions</strong><br />\nThank you for choosing to be part of our community at DeshBidesh (“DeshBidesh”, “we”, “us”, or “our”). By downloading or using the app, these terms will automatically apply to you – you should make sure therefore that you read them carefully before using the app. You’re not allowed to copy, or modify the app, any part of the app, or our trademarks in any way. You’re not allowed to attempt to extract the source code of the app, and you also shouldn’t try to translate the app into other languages, or make derivative versions. The app itself, and all the trade marks, copyright, database rights and other intellectual property rights related to it, still belong to DeshBidesh.</p>\n<p>DeshBidesh is committed to ensuring that the app is as useful and efficient as possible. For that reason, we reserve the right to make changes to the app or to charge for its services, at any time and for any reason. We will never charge you for the app or its services without making it very clear to you exactly what you’re paying for.</p>\n<p>The &#8220;DeshBidesh app&#8221; stores and processes personal data that you have provided to us, in order to provide our Service. It’s your responsibility to keep your phone and access to the app secure. We therefore recommend that you do not jailbreak or root your mobile device, which is the process of removing software restrictions and limitations imposed by the official operating system of your device. It could make your phone vulnerable to malware/viruses/malicious programs, compromise your mobile device&#8217;s security features and it could mean that the &#8220;DeshBidesh&#8221; app won’t work properly or at all.</p>\n<p>You should be aware that there are certain things that DeshBidesh will not take responsibility for. Certain functions of the app will require the app to have an active internet connection. The connection can be Wi-Fi, or provided by your mobile network provider, but DeshBidesh cannot take responsibility for the app not working at full functionality if you don’t have access to Wi-Fi, and you don’t have any of your data allowance left.</p>\n<p>If you’re using the app outside of an area with Wi-Fi, you should remember that your terms of the agreement with your mobile network provider will still apply. As a result, you may be charged by your mobile provider for the cost of data for the duration of the connection while accessing the app, or other third party charges. In using the app, you’re accepting responsibility for any such charges, including roaming data charges if you use the app outside of your home territory (i.e. region or country) without turning off data roaming. If you are not the bill payer for the device on which you’re using the app, please be aware that we assume that you have received permission from the bill payer for using the app.</p>\n<p>With respect to DeshBidesh&#8217;s responsibility for your use of the app, when you’re using the app, it’s important to bear in mind that although we endeavour to ensure that it is updated and correct at all times, we do rely on third parties to provide information to us so that we can make it available to you. DeshBidesh accepts no liability for any loss, direct or indirect, your experience as a result of relying wholly on this functionality of the app.</p>\n<p>At some point, we may wish to update the app. The app is currently available on iOS operating system (13 and higher) – the requirements for system (and for any additional systems we decide to extend the availability of the app to) may change, and you’ll need to download the updates if you want to keep using the app. DeshBidesh does not promise that it will always update the app so that it is relevant to you and/or works with the version that you have installed on your device. However, you promise to always accept updates to the application when offered to you, We may also wish to stop providing the app, and may terminate use of it at any time without giving notice of termination to you. Unless we tell you otherwise, upon any termination,<br />\n(a) the rights and licenses granted to you in these terms will end;<br />\n(b) you must stop using the app, and (if needed) delete it from your device.</p>\n<p><strong>Changes to This Terms and Conditions</strong><br />\nWe may update our Terms and Conditions from time to time. Thus, you are advised to review this page periodically for any changes. I will notify you of any changes by posting the new Terms and Conditions on this page. These changes are effective immediately after they are posted on this page.</p>\n<p><strong>Contact Us<br />\n</strong>If you have any questions or suggestions about our Terms and Conditions, do not hesitate to contact us at &#8220;informationdeshbidesh@gmail.com&#8221; or you can fill the form on the website &lt;a href=&#8221;/&#8221;&gt; DeshBidesh &lt;/a&gt; .</p>\n",
  "privacy_policy": "<p><strong>PRIVACY POLICY</strong></p>\n<p>Thank you for choosing to be part of our community at DeshBidesh (“DeshBidesh”, “we”, “us”, or “our”). We are committed to protecting your personal information and your right to privacy. If you have any questions or concerns about our policy, or our practices with regards to your personal information, please contact us at &#8220;informationdeshbidesh@gmail.com&#8221; or fill a form on our website &lt;a href=&#8221;https://deshbidesh.co.uk&#8221;&gt; here&lt;/a&gt;.</p>\n<p>When you visit our &lt;a href=&#8221;https://deshbidesh.co.uk&#8221;&gt; website&lt;/a&gt;, mobile application &#8220;DeshBidesh&#8221;, and use our services, you trust us with your personal information. We take your privacy very seriously. In this privacy policy, we seek to explain to you in the clearest way possible what information we collect, how we use it and what rights you have in relation to it. We hope you take some time to read through it carefully, as it is important. If there are any terms in this privacy policy that you do not agree with, please discontinue use of our Apps or Websites and our services.</p>\n<p>This privacy policy applies to all information collected through our website (such as &lt;a href=&#8221;https://deshbidesh.co.uk&#8221;&gt; DeshBidesh &lt;/a&gt;), mobile application, (&#8220;DeshBidesh&#8221;), and/or any related services, sales, marketing or events (we refer to them collectively in this privacy policy as the &#8220;Services&#8221;).</p>\n<p><strong>Please read this privacy policy carefully as it will help you make informed decisions about sharing your personal information with us.</strong></p>\n<p><strong>TABLE OF CONTENTS</strong></p>\n<p>1. WHAT INFORMATION DO WE COLLECT?<br />\n2. HOW DO WE USE YOUR INFORMATION?<br />\n3. WILL YOUR INFORMATION BE SHARED WITH ANYONE?<br />\n4. WHO WILL YOUR INFORMATION BE SHARED WITH?<br />\n5. COOKIES<br />\n6. LINKS TO OTHER SITES<br />\n7. CHILDREN<br />\n8. SECURITY<br />\n9. CHANGES TO THIS PRIVACY POLICY<br />\n10. CONTACT INFORMATION</p>\n<p><strong>WHAT INFORMATION DO WE COLLECT?</strong><br />\nWe collect and process the following information which may include your personal data.<br />\n<strong>a)</strong> <strong>Information provided by you when using the &#8220;DeshBidesh&#8221; (Basic Information)</strong><br />\nWe will collect the following information from you when you use our app:<br />\n1. Your mobile device’s current region (i.e if you are in Great Britain &#8220;GB&#8221;) so that we can show you contents from the region.</p>\n<p><strong>b) Information used for the purposes of serving advertisements</strong></p>\n<p>Through our third party advertising network partners &lt;a href=&#8221;https://support.google.com/admob/answer/6128543?hl=en&#8221; target=&#8221;_blank&#8221;&gt;AdMob&lt;/a&gt;, we may gather information about your devices when you install or use our app, depending on the permissions you’ve granted. For detail information please visit &lt;a href=&#8221;https://policies.google.com/technologies/partner-sites&#8221; target=&#8221;_blank&#8221;&gt;Here&lt;/a&gt;.</p>\n<p><strong>c)</strong> <strong>To respond to your enquiries and requests for support</strong></p>\n<p>We may process contact information (i.e. name &amp; email) through our website &lt;a href=&#8221;/&#8221;&gt;DeshBidesh&lt;/a&gt; (we do not process email from &#8220;DeshBidesh&#8221; mobile app) which you have provided us from our &#8220;contact us&#8221; form or our email &#8220;informationdeshbidesh@gmail.com&#8221; so that we are able to properly respond to your enquiries and support requests.</p>\n<p><strong>e)</strong> <strong>Information collected for the purposes of providing analytics</strong></p>\n<p>We may collect technical information about your use of the Online Services through the use of tracking technologies and analytics with &lt;a href=&#8221;https://firebase.google.com/docs/analytics&#8221; target=&#8221;_blank&#8221;&gt;Firebase Analytics&lt;/a&gt;</p>\n<p><strong>f )</strong> <strong>To help us improve the Online Services and fix any bugs</strong></p>\n<p>To provide better user experience we may collect information such as your device Internet Protocol (“IP”) address, device name, operating system version, the configuration of the app when utilizing our Service, the time and date of your use of the Service, and other statistics via &lt;a href=&#8221;https://firebase.google.com/terms/crashlytics&#8221; target=&#8221;_blank&#8221;&gt;Firebase Crashlytics&lt;/a&gt;</p>\n<p>We also may use the information in other ways for which we provide specific notice at the time of collection.</p>\n<p><strong>Push Notifications</strong></p>\n<p>iOS/Android : DeshBidesh uses Firebase Cloud Messaging (FCM) and Apple Push Notification Service (APNs) to inform users about new Article while the app is closed or in background. Upon creation of a new article, deshbidesh server passes a playload with json securely to FCM server. FCM uses Apple Push Notification Authentication Key to send Push Notifications to the application identified by the App ID. More info &lt;a href=&#8221;https://firebase.google.com/docs/cloud-messaging/fcm-architectures&#8221; target=&#8221;_blank&#8221;&gt;FCM.&lt;/a&gt;</p>\n<p>The payload json contain article id, title, summary, image link, article link in the DeshBidesh server. The DeshBidesh app is started in the background for each incoming push notification, decrypts the push payload, and uses the article id to call DeshBidesh server for the complete data to show to the user (if enabled).The message you will receive will be based on your mobile device’s current region i.e.&#8221;GB&#8221; which means if your device is in &#8220;GB&#8221; you won&#8217;t receive message for &#8220;US&#8221;. We use FCM topics which is publish/subscribe model. More info &lt;a href=&#8221;https://firebase.google.com/docs/cloud-messaging/ios/topic-messaging&#8221; target=&#8221;_blank&#8221;&gt;FCM Topics&lt;/a&gt;</p>\n<p>User consent is always asked before we send any notifications. At any time, you can manage your push notification preferences or deactivate these notifications at any time by turning off the notification &#8220;Settings&#8221; in the App or in the Device Settings of your mobile device.</p>\n<p><strong>Photos Roll</strong><br />\niOS/Android : To save photos from our DeshBidesh app, we will access your device camera roll with your permission. If you need to update your permissions, you can do so in the “Settings” app of your device.</p>\n<p><strong>HOW DO WE USE YOUR INFORMATION?</strong></p>\n<p>In Short : We process your information for purposes based on legitimate business interests, the fulfilment of our contract with you, compliance with our legal obligations, and/or your consent.</p>\n<p>We use personal information collected via our Services or Apps for a variety of business purposes described below. We process your personal information for these purposes in reliance on our legitimate business interests, in order to enter into or perform a contract with you, with your consent, and/or for compliance with our legal obligations. We indicate the specific processing grounds we rely on next to each purpose listed below.</p>\n<p>Below are some definitions that will help you understand the roles and responsibilities of DeshBidesh:</p>\n<p>“data controller” means a person who (either alone or jointly or in common with other persons) determines the purposes for which and the manner in which any personal information are, or are to be used.<br />\n“data processor”, in relation to personal information, means any person (other than an employee of the data controller) who processes the data on behalf of the data controller.</p>\n<p>If you provide the data and the instructions, then you are the data controller and DeshBidesh is the data processor. If we determine the purposes for which we collect and use your personal information, then we are the Controller. We use the information we collect or receive:</p>\n<p><strong>Deliver targeted advertising to you</strong>. We may use your information to develop and display content and advertising (and work with third parties who do so) tailored to your interests and/or location and to measure its effectiveness.</p>\n<p><strong>Request Feedback</strong>. We may use your information to request feedback and to contact you about your use of our Services or Apps.</p>\n<p><strong>To protect our Service</strong>s. We may use your information as part of our efforts to keep our Services or Apps safe and secure (for example, for fraud monitoring and prevention).</p>\n<p><strong>To enforce our terms, conditions and policies for Business Purposes, Legal Reasons and Contractual</strong>.</p>\n<p><strong>To respond to legal requests and prevent harm</strong>. If we receive a subpoena or other legal request, we may need to inspect the data we hold to determine how to respond.</p>\n<p><strong>To deliver services to the user</strong>. We may use your information to provide you with the requested service.</p>\n<p><strong>To deliver better user experience with analytics</strong>.</p>\n<p><strong>WILL YOUR INFORMATION BE SHARED WITH ANYONE?</strong></p>\n<p>We only share information with your consent, to comply with laws, to provide you with services, to protect your rights, or to fulfil business obligations.</p>\n<p>We may process or share data based on the following legal basis:</p>\n<p>Consent: We may process your data if you have given us specific consent to use your personal information in a specific purpose.</p>\n<p>Legitimate Interests: We may process your data when it is reasonably necessary to achieve our legitimate business interests.</p>\n<p>Performance of a Contract: Where we have entered into a contract with you, we may process your personal information to fulfil the terms of our contract.</p>\n<p>Legal Obligations: We may disclose your information where we are legally required to do so in order to comply with applicable law, governmental requests, a judicial proceeding, court order, or legal process, such as in response to a court order or a subpoena (including in response to public authorities to meet national security or law enforcement requirements).</p>\n<p>Vital Interests: We may disclose your information where we believe it is necessary to investigate, prevent, or take action regarding potential violations of our policies, suspected fraud, situations involving potential threats to the safety of any person and illegal activities, or as evidence in litigation in which we are involved.</p>\n<p><strong>WHO WILL YOUR INFORMATION BE SHARED WITH?</strong></p>\n<p>We only share and disclose your information with the following third parties. We have categorised each party so that you may be easily understand the purpose of our data collection and processing practices. If we have processed your data based on your consent and you wish to revoke your consent, please contact us at &#8220;informationdeshbidesh@gmail.com&#8221; or fill a form on our website &lt;a href=&#8221;/&#8221;&gt; here&lt;/a&gt;.</p>\n<p>&lt;p&gt; Moreover in the Mobile App we use Firebase (&lt;a href=&#8221;https://www.firebase.com/&#8221;&gt;https://www.firebase.com/&lt;/a&gt;), a framework maintained by the Google subsidiary Firebase residing in San Francisco, CA, USA, through which we track and administer the following real-time functions.<br />\nAdvertising through Firebase AdMob<br />\nTracking of app crashes and their reasons through Firebase Crashlytics<br />\nTracking of user behavior through Google Analytics for Firebase</p>\n<p>For all mentioned Firebase services, only anonymised or pseudonymized user data is transmitted to Firebase (Google). Firebase’s privacy policy is available under &lt;a href=&#8221;https://www.firebase.com/terms/privacy-policy.html&#8221;&gt; Firebase Privacy Policy&lt;/a&gt;.</p>\n<p><strong>COOKIES</strong><br />\nCookies are files with a small amount of data that are commonly used as anonymous unique identifiers. These are sent to your browser from the websites that you visit and are stored on your device&#8217;s internal memory.</p>\n<p>This Service does not use these “cookies” explicitly. However, the app may use third party code and libraries that use “cookies” to collect information and improve their services. You have the option to either accept or refuse these cookies and know when a cookie is being sent to your device. If you choose to refuse our cookies, you may not be able to use some portions of this Service.</p>\n<p>Most web browsers allow you to control cookies through your browser settings. To find out more about cookies generally and how to manage or delete them, you can visit &lt;a href=&#8221;https://www.allaboutcookies.org/&#8221; target=&#8221;_blank&#8221;&gt; here&lt;/a&gt;.</p>\n<p><strong>LINKS TO OTHER SITES</strong><br />\nThis Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.</p>\n<p><strong>CHILDREN</strong><br />\nThese Services do not address anyone under the age of 13. We do not knowingly collect personally identifiable information from children under 13. In the case we discover that a child under 13 has provided us with personal information, we will immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us at &#8220;informationdeshbidesh@gmail.com&#8221; so that we will be able to take necessary actions.</p>\n<p><strong>SECURITY</strong><br />\nWe value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. We will take all reasonable technical and organisational precautions to prevent the loss, misuse or alteration of your personal information. For example, our databases are password protected and limited to essential members only (members whose main role requires CMS management).</p>\n<p>Please be aware that, although we endeavour to provide reasonable security for information we process and maintain, no security system can prevent all potential security breaches.</p>\n<p><strong>CHANGES TO THIS PRIVACY POLICY</strong></p>\n<p>We may update our Privacy Policy from time to time. Thus, you are advised to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately after they are posted on this page.</p>\n<p><strong>CONTACT INFORMATION</strong></p>\n<p>If you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us at informationdeshbidesh@gmail.com or you can fill the form on the website &lt;a href=&#8221;/&#8221;&gt; DeshBidesh &lt;/a&gt;.</p>\n",
  "legal_disclosure": "<p>MOBILE APP DISCLAIMER</p>\n<p>The information provided by DeshBidesh (&#8220;DeshBidesh&#8221;, &#8220;we&#8221;, &#8220;us&#8221; or &#8220;our&#8221;) on &lt;a href=&#8221;/&#8221;&gt; DeshBidesh &lt;/a&gt; (the &#8220;Site&#8221;) and our mobile application (the &#8220;DeshBidesh&#8221;) is for general informational purposes only. All information on the Site and our mobile application is provided in good faith, however we make no representation or warranty of any kind, express or implied, regarding the accuracy, adequacy, validity, reliability, availability or completeness of any information on the Site or our mobile application. UNDER NO CIRCUMSTANCE SHALL WE HAVE ANY LIABILITY TO YOU FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF THE SITE OR OUR MOBILE APPLICATION OR RELIANCE ON ANY INFORMATION PROVIDED ON THE SITE AND OUR MOBILE APPLICATION. YOUR USE OF THE SITE AND OUR MOBILE APPLICATION AND YOUR RELIANCE ON ANY INFORMATION ON THE SITE AND OUR MOBILE APPLICATION IS SOLELY AT YOUR OWN RISK.</p>\n<p>EXTERNAL LINKS DISCLAIMER</p>\n<p>The Site and our mobile application may contain (or you may be sent through the Site or our mobile application) links to other websites or content belonging to or originating from third parties or links to websites and features in banners or other advertising. Such external links are not investigated, monitored, or checked for accuracy, adequacy, validity, reliability, availability or completeness by us. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR THE ACCURACY OR RELIABILITY OF ANY INFORMATION OFFERED BY THIRD-PARTY WEBSITES LINKED THROUGH THE SITE OR ANY WEBSITE OR FEATURE LINKED IN ANY BANNER OR OTHER ADVERTISING. WE WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES.</p>\n",
  "facebook": "https://www.facebook.com/deshbideshapp/",
  "youtube": "https://www.youtube.com/channel/UC22Tp-7tetG-CwbnNPPkeWQ",
  "instagram": "https://www.instagram.com/deshbideshapp/",
  "twitter": "https://twitter.com/DeshBidesh4"
}